---
title: DocumentFailures
classe: Autodesk.Revit.DB.BuiltInFailures+DocumentFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# DocumentFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId ApiDelayedUpdateFailed { get; }` | `DocumentFailures.ApiDelayedUpdateFailed` | FailureDefinitionId |
| `FailureDefinitionId CannotAutoUpdate { get; }` | `DocumentFailures.CannotAutoUpdate` | FailureDefinitionId |
| `FailureDefinitionId CannotLoadLink { get; }` | `DocumentFailures.CannotLoadLink` | FailureDefinitionId |
| `FailureDefinitionId DUExcessiveRegeneration { get; }` | `DocumentFailures.DUExcessiveRegeneration` | FailureDefinitionId |
| `FailureDefinitionId DUMisbehavingUpdater { get; }` | `DocumentFailures.DUMisbehavingUpdater` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```